benchmarking/artillery.yml
config:
  target: "http://localhost:3003"
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 100
      rampTo: 500
    - duration: 60
      arrivalRate: 500
      rampTo: 1000
    - duration: 60
      arrivalRate: 1000
      rampTo: 1500
  processor: "./artilleryHelper.js"

scenarios:
  - name: "Get and Post"
    flow:
      - function: "getRandNum"
      - get:
          url: "/restaurants/"
      - get:
          url: "/api/restaurants/{{ randNum }}"
      #- think: 3
      #- post:
          #url: "/cart"
          #json:
            #productId: "{{ id }}"